In [ ]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
%matplotlib inline

In [ ]:
df=pd.read_csv('/content/tested.csv')
df.head(10)

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0          892         0       3  ...   7.8292   NaN         Q
1          893         1       3  ...   7.0000   NaN         S
2          894         0       2  ...   9.6875   NaN         Q
3          895         0       3  ...   8.6625   NaN         S
4          896         1       3  ...  12.2875   NaN         S
5          897         0       3  ...   9.2250   NaN         S
6          898         1       3  ...   7.6292   NaN         Q
7          899         0       2  ...  29.0000   NaN         S
8          900         1       3  ...   7.2292   NaN         C
9          901         0       3  ...  24.1500   NaN         S

[10 rows x 12 columns]

In [ ]:
df.isnull().any()

PassengerId    False
Survived       False
Pclass         False
Name           False
Sex            False
Age             True
SibSp          False
Parch          False
Ticket         False
Fare            True
Cabin           True
Embarked       False
dtype: bool

In [ ]:
df.drop('Age',axis=1,inplace=True)

In [ ]:
df.drop('Name',axis=1,inplace=True)

In [ ]:
df.drop('Pclass',axis=1,inplace=True)

In [ ]:
df.drop('PassengerId',axis=1,inplace=True)

In [ ]:
df.drop('Fare',axis=1,inplace=True)

In [ ]:
df

     Survived     Sex  SibSp  Parch              Ticket Cabin Embarked
0           0    male      0      0              330911   NaN        Q
1           1  female      1      0              363272   NaN        S
2           0    male      0      0              240276   NaN        Q
3           0    male      0      0              315154   NaN        S
4           1  female      1      1             3101298   NaN        S
..        ...     ...    ...    ...                 ...   ...      ...
413         0    male      0      0           A.5. 3236   NaN        S
414         1  female      0      0            PC 17758  C105        C
415         0    male      0      0  SOTON/O.Q. 3101262   NaN        S
416         0    male      0      0              359309   NaN        S
417         0    male      1      1                2668   NaN        C

[418 rows x 7 columns]

In [ ]:
df.drop('Cabin',axis=1,inplace=True)

In [ ]:
df.drop('Ticket',axis=1,inplace=True)

In [ ]:
df

     Survived     Sex  SibSp  Parch Embarked
0           0    male      0      0        Q
1           1  female      1      0        S
2           0    male      0      0        Q
3           0    male      0      0        S
4           1  female      1      1        S
..        ...     ...    ...    ...      ...
413         0    male      0      0        S
414         1  female      0      0        C
415         0    male      0      0        S
416         0    male      0      0        S
417         0    male      1      1        C

[418 rows x 5 columns]

In [ ]:
sex=pd.get_dummies(df['Sex'],drop_first=True)
sex.head(5)

   male
0     1
1     0
2     1
3     1
4     0

In [ ]:
emb=pd.get_dummies(df['Embarked'],drop_first=True)
emb.head(5)

   Q  S
0  1  0
1  0  1
2  1  0
3  0  1
4  0  1

In [ ]:
df=pd.concat([df,sex,emb],axis=1)
df.head(5)

   Survived     Sex  SibSp  Parch Embarked  male  Q  S
0         0    male      0      0        Q     1  1  0
1         1  female      1      0        S     0  0  1
2         0    male      0      0        Q     1  1  0
3         0    male      0      0        S     1  0  1
4         1  female      1      1        S     0  0  1

In [ ]:
df.drop(['Sex','Embarked'],axis=1,inplace=True)

In [ ]:
df.head(5)

   Survived  SibSp  Parch  male  Q  S
0         0      0      0     1  1  0
1         1      1      0     0  0  1
2         0      0      0     1  1  0
3         0      0      0     1  0  1
4         1      1      1     0  0  1

In [ ]:
x=df[['SibSp','Parch','male','Q','S']]
y=df['Survived']

In [ ]:
from sklearn.model_selection import train_test_split
x_train,x_test,y_train,y_test=train_test_split(x,y,test_size=0.30,random_state=101)

In [ ]:
from sklearn.linear_model import LogisticRegression
logmodel=LogisticRegression()
logmodel.fit(x_train,y_train)

LogisticRegression()

In [ ]:
y_pred = logmodel.predict(x_test)

In [ ]:
y_pred

array([0, 1, 1, 0, 0, 0, 0, 0, 0, 0, 1, 0, 1, 0, 0, 0, 1, 1, 1, 0, 0, 0,
       1, 0, 0, 1, 1, 1, 1, 0, 1, 1, 0, 0, 1, 1, 1, 0, 1, 1, 1, 1, 1, 0,
       1, 0, 0, 0, 1, 1, 0, 1, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1,
       0, 0, 0, 1, 1, 1, 0, 0, 0, 0, 0, 1, 0, 1, 1, 1, 1, 1, 1, 0, 0, 1,
       1, 1, 0, 1, 0, 0, 0, 1, 1, 0, 0, 1, 0, 0, 1, 1, 1, 0, 0, 1, 0, 0,
       0, 1, 0, 0, 1, 1, 0, 0, 1, 0, 0, 0, 1, 0, 0, 1])

In [ ]:
from sklearn.metrics import classification_report
print(classification_report(y_test,y_pred))

              precision    recall  f1-score   support

           0       1.00      1.00      1.00        71
           1       1.00      1.00      1.00        55

    accuracy                           1.00       126
   macro avg       1.00      1.00      1.00       126
weighted avg       1.00      1.00      1.00       126